app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("created_at", "pict_file", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @picture = Picture.new(params[:picture])

    respond_to do |format|
      if @picture.save