app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def show
    #@picture = Picture.find(params[:id])
    @pictures = Picture.all